src_ext/Documents/УЗ_НачислениеБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_НачислениеБонусов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДисконтныеКарты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_НачислениеБонусов/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.УЗ_НачислениеБонусов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеБонусов.АвторДокумента КАК АвторДокумента,
	|	НачислениеБонусов.Дата КАК Дата,
	|	НачислениеБонусов.Комментарий КАК Комментарий,
	|	НачислениеБонусов.Номер КАК Номер,
	|	НачислениеБонусов.СуммаБонусов КАК СуммаБонусов,
	|	НачислениеБонусов.ДисконтныеКарты.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДисконтнаяКарта.Владелец КАК Ученик,
	|		ДисконтнаяКарта КАК ДисконтнаяКарта,
	|		СуммаБонусов КАК СуммаБонусов,
	|		ДисконтнаяКарта.ДатаОкончанияДействия КАК ДатаСписания
	|	) КАК ДисконтныеКарты,
	|	НачислениеБонусов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УЗ_НачислениеБонусов КАК НачислениеБонусов
	|ГДЕ
	|	НачислениеБонусов.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДисконтныеКартыШапка = Макет.ПолучитьОбласть("ДисконтныеКартыШапка");
	ОбластьДисконтныеКарты = Макет.ПолучитьОбласть("ДисконтныеКарты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		Если Выборка.Ссылка.ДисконтныеКарты.Количество() > 0 Тогда
		ТабДок.Вывести(ОбластьДисконтныеКартыШапка);
		ВыборкаДисконтныеКарты = Выборка.ДисконтныеКарты.Выбрать();
		Пока ВыборкаДисконтныеКарты.Следующий() Цикл
			ОбластьДисконтныеКарты.Параметры.Заполнить(ВыборкаДисконтныеКарты);
			ТабДок.Вывести(ОбластьДисконтныеКарты, ВыборкаДисконтныеКарты.Уровень());
		КонецЦикла;
		КонецЕсли;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
